JohnnyB1290/jblib-imxrt-jbrivers/src/jbdrivers/JbController.cpp
/**
 * @file
 * @brief JbController Core class realization
 *
 *
 * @note
 * Copyright © 2019 Evgeniy Ivanov. Contacts: <strelok1290@gmail.com>
 * All rights reserved.
 * @note
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 * @note
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @note
 * This file is a part of JB_Lib.
 */

// This is an open source non-commercial project. Dear PVS-Studio, please check it.

// PVS-Studio Static Code Analyzer for C, C++, C#, and Java: http://www.viva64.com

#include <string.h>
#include "jbdrivers/JbController.hpp"
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "fsl_gpio.h"



namespace jblib::jbdrivers
{

using namespace jbkernel;


BoardGpio_t JbController::boardGpios_[] = JBCONTROLLER_BOARD_GPIOS;
bool JbController::isInitialized = false;
IVoidCallback* JbController::mainProcedures_[JBCONTROLLER_NUM_MAIN_PROCEDURES];
void* JbController::mainProceduresParameters_[JBCONTROLLER_NUM_MAIN_PROCEDURES];



void JbController::initialize(void)
{
	if(!isInitialized) {
		for(uint32_t i = 0; i < JBCONTROLLER_NUM_MAIN_PROCEDURES; i++){
			mainProcedures_[i] = NULL;
			mainProceduresParameters_[i] = NULL;
		}
		NVIC_SetPriorityGrouping(0x03); //All 4 bits for pre-emption priority
		__enable_irq();
		BOARD_InitBootPins();
	    BOARD_InitBootClocks();
	    BOARD_InitBootPeripherals();
		isInitialized = true;
	}
}



void JbController::delayMs(uint32_t ms)  //For 600MHz Clock
{
	for(uint32_t i = 0; i < ms; i++)
		for(uint32_t j = 0; j < JBCONTROLLER_NUM_NOP_DELAY_MS; j++)
			__NOP();
}



void JbController::delayUs(uint32_t us) //For 600MHz Clock
{
	for(uint32_t i = 0; i < us * JBCONTROLLER_NUM_NOP_DELAY_US; i++)
		__NOP();
}



void JbController::gpioOn(uint8_t number)
{
	GPIO_PortSet((GPIO_Type*)boardGpios_[number].gpioBasePointer,
			1U << boardGpios_[number].gpioPin);
}



void JbController::gpioOff(uint8_t number)
{
	GPIO_PortClear((GPIO_Type*)boardGpios_[number].gpioBasePointer,
			1U << boardGpios_[number].gpioPin);
}



void JbController::gpioTgl(uint8_t number)
{
	GPIO_PortToggle((GPIO_Type*)boardGpios_[number].gpioBasePointer,
			1U << boardGpios_[number].gpioPin);
}



void JbController::resetPeriphery(void)
{
	for(uint32_t i = 0; i < 52; i++) {
		NVIC_DisableIRQ((IRQn_Type)i);
		NVIC_ClearPendingIRQ((IRQn_Type)i);
	}
}



void JbController::softReset(void)
{
//	Chip_RGU_TriggerReset(RGU_M3_RST);
//	while (Chip_RGU_InReset(RGU_M3_RST)) {}
}



void JbController::goToApp(uint32_t applicationAddress)
{
	__disable_irq();
//	LPC_CREG->MXMEMMAP = applicationAddress & ~0xFFF;
	JbController::delayUs(100);
	JbController::softReset();
}



void JbController::doMain(void)
{
	for(uint32_t i = 0; i < JBCONTROLLER_NUM_MAIN_PROCEDURES; i++) {
		if(mainProcedures_[i])
			mainProcedures_[i]->voidCallback(NULL,
					mainProceduresParameters_[i]);
		else
			break;
	}
}



void JbController::addMainProcedure(IVoidCallback* callback, void* parameter)
{
	for(uint32_t i = 0; i < JBCONTROLLER_NUM_MAIN_PROCEDURES; i++) {
		if((mainProcedures_[i] == callback) &&
				mainProceduresParameters_[i] == parameter){
			break;
		}
		if(mainProcedures_[i] == NULL) {
			mainProcedures_[i] = callback;
			mainProceduresParameters_[i] = parameter;
			break;
		}
	}
}



void JbController::deleteMainProcedure(IVoidCallback* callback, void* parameter)
{
	uint32_t index = 0;
	for(uint32_t i = 0; i < JBCONTROLLER_NUM_MAIN_PROCEDURES; i++) {
		if((mainProcedures_[i] == callback) &&
				mainProceduresParameters_[i] == parameter){
			break;
		}
		else
			index++;
	}
	if(index == (JBCONTROLLER_NUM_MAIN_PROCEDURES-1)) {
		if((mainProcedures_[index] == callback) &&
				mainProceduresParameters_[index] == parameter){
			mainProcedures_[index] = NULL;
			mainProceduresParameters_[index] = NULL;
		}
	}
	else {
		for(uint32_t i = index; i < (JBCONTROLLER_NUM_MAIN_PROCEDURES - 1); i++) {
			mainProcedures_[i] = mainProcedures_[i+1];
			mainProceduresParameters_[i] = mainProceduresParameters_[i+1];
			if(mainProcedures_[i+1] == NULL)
				break;
		}
	}
}



void JbController::addMainProcedure(IVoidCallback* callback)
{
	addMainProcedure(callback, NULL);
}



void JbController::deleteMainProcedure(IVoidCallback* callback)
{
	deleteMainProcedure(callback, NULL);
}



uint32_t JbController::getHeapFree(void)
{
    uint32_t ret = 10;
    __disable_irq();
    void* ptr = malloc(ret);
    while(ptr != NULL){
        free(ptr);
        ret += 10;
        ptr = malloc(ret);
    }
    __enable_irq();
    return ret;
}

}
